### 🛠 Terraform Plan Output

```
[command]/home/runner/work/_temp/29c7e88b-c5cf-4198-8d04-620b33feb219/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.rds_app will be created
  + resource "aws_db_instance" "rds_app" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "jackdenchappdb"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "jackdench-task-listing-app-prod"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_ecr_repository.task_listing_app_repository will be created
  + resource "aws_ecr_repository" "task_listing_app_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "jackdench-task-app-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_elastic_beanstalk_application.task_listing_app will be created
  + resource "aws_elastic_beanstalk_application" "task_listing_app" {
      + arn         = (known after apply)
      + description = "Task listing app"
      + id          = (known after apply)
      + name        = "jackdench-task-listing-app"
      + tags_all    = (known after apply)
    }

  # aws_elastic_beanstalk_environment.task_listing_app_environment will be created
  + resource "aws_elastic_beanstalk_environment" "task_listing_app_environment" {
      + all_settings           = (known after apply)
      + application            = "jackdench-task-listing-app"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "jackdench-task-listing-app-environment"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2023 v4.0.1 running Docker"
      + tags_all               = (known after apply)
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "EC2KeyName"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "jackdench"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "jackdench-task-listing-app-ec2-instance-profile"
        }
    }

  # aws_iam_instance_profile.task_listing_app_ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "task_listing_app_ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "jackdench-task-listing-app-ec2-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "jackdench-task-listing-app-ec2-instance-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.task_listing_app_ec2_role will be created
  + resource "aws_iam_role" "task_listing_app_ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "jackdench-task-listing-app-ec2-instance-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.eb_multi_container_docker will be created
  + resource "aws_iam_role_policy_attachment" "eb_multi_container_docker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"
      + role       = "jackdench-task-listing-app-ec2-instance-role"
    }

  # aws_iam_role_policy_attachment.eb_web_tier will be created
  + resource "aws_iam_role_policy_attachment" "eb_web_tier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"
      + role       = "jackdench-task-listing-app-ec2-instance-role"
    }

  # aws_iam_role_policy_attachment.eb_worker_tier will be created
  + resource "aws_iam_role_policy_attachment" "eb_worker_tier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"
      + role       = "jackdench-task-listing-app-ec2-instance-role"
    }

  # aws_iam_role_policy_attachment.ec2_full_access will be created
  + resource "aws_iam_role_policy_attachment" "ec2_full_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
      + role       = "jackdench-task-listing-app-ec2-instance-role"
    }

  # aws_iam_role_policy_attachment.ecr_read_only will be created
  + resource "aws_iam_role_policy_attachment" "ecr_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "jackdench-task-listing-app-ec2-instance-role"
    }

  # aws_s3_bucket.container_bucket will be created
  + resource "aws_s3_bucket" "container_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "jackdench-task-listing-app-container-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "name" = "jackdench-task-listing-app-container-bucket"
        }
      + tags_all                    = {
          + "name" = "jackdench-task-listing-app-container-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.rds_app will be created%0A  + resource "aws_db_instance" "rds_app" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "jackdenchappdb"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "15.7"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "jackdench-task-listing-app-prod"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + name                                  = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = true%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "root"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.task_listing_app_repository will be created%0A  + resource "aws_ecr_repository" "task_listing_app_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "jackdench-task-app-repository"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A    }%0A%0A  # aws_elastic_beanstalk_application.task_listing_app will be created%0A  + resource "aws_elastic_beanstalk_application" "task_listing_app" {%0A      + arn         = (known after apply)%0A      + description = "Task listing app"%0A      + id          = (known after apply)%0A      + name        = "jackdench-task-listing-app"%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # aws_elastic_beanstalk_environment.task_listing_app_environment will be created%0A  + resource "aws_elastic_beanstalk_environment" "task_listing_app_environment" {%0A      + all_settings           = (known after apply)%0A      + application            = "jackdench-task-listing-app"%0A      + arn                    = (known after apply)%0A      + autoscaling_groups     = (known after apply)%0A      + cname                  = (known after apply)%0A      + cname_prefix           = (known after apply)%0A      + endpoint_url           = (known after apply)%0A      + id                     = (known after apply)%0A      + instances              = (known after apply)%0A      + launch_configurations  = (known after apply)%0A      + load_balancers         = (known after apply)%0A      + name                   = "jackdench-task-listing-app-environment"%0A      + platform_arn           = (known after apply)%0A      + queues                 = (known after apply)%0A      + solution_stack_name    = "64bit Amazon Linux 2023 v4.0.1 running Docker"%0A      + tags_all               = (known after apply)%0A      + tier                   = "WebServer"%0A      + triggers               = (known after apply)%0A      + version_label          = (known after apply)%0A      + wait_for_ready_timeout = "20m"%0A%0A      + setting {%0A          + name      = "EC2KeyName"%0A          + namespace = "aws:autoscaling:launchconfiguration"%0A          + value     = "jackdench"%0A        }%0A      + setting {%0A          + name      = "IamInstanceProfile"%0A          + namespace = "aws:autoscaling:launchconfiguration"%0A          + value     = "jackdench-task-listing-app-ec2-instance-profile"%0A        }%0A    }%0A%0A  # aws_iam_instance_profile.task_listing_app_ec2_instance_profile will be created%0A  + resource "aws_iam_instance_profile" "task_listing_app_ec2_instance_profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "jackdench-task-listing-app-ec2-instance-profile"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "jackdench-task-listing-app-ec2-instance-role"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_role.task_listing_app_ec2_role will be created%0A  + resource "aws_iam_role" "task_listing_app_ec2_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "jackdench-task-listing-app-ec2-instance-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.eb_multi_container_docker will be created%0A  + resource "aws_iam_role_policy_attachment" "eb_multi_container_docker" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.eb_web_tier will be created%0A  + resource "aws_iam_role_policy_attachment" "eb_web_tier" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.eb_worker_tier will be created%0A  + resource "aws_iam_role_policy_attachment" "eb_worker_tier" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ec2_full_access will be created%0A  + resource "aws_iam_role_policy_attachment" "ec2_full_access" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecr_read_only will be created%0A  + resource "aws_iam_role_policy_attachment" "ecr_read_only" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_s3_bucket.container_bucket will be created%0A  + resource "aws_s3_bucket" "container_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "jackdench-task-listing-app-container-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "name" = "jackdench-task-listing-app-container-bucket"%0A        }%0A      + tags_all                    = {%0A          + "name" = "jackdench-task-listing-app-container-bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0APlan: 12 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.rds_app will be created%0A  + resource "aws_db_instance" "rds_app" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "jackdenchappdb"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "15.7"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "jackdench-task-listing-app-prod"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + name                                  = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = true%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "root"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.task_listing_app_repository will be created%0A  + resource "aws_ecr_repository" "task_listing_app_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "jackdench-task-app-repository"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A    }%0A%0A  # aws_elastic_beanstalk_application.task_listing_app will be created%0A  + resource "aws_elastic_beanstalk_application" "task_listing_app" {%0A      + arn         = (known after apply)%0A      + description = "Task listing app"%0A      + id          = (known after apply)%0A      + name        = "jackdench-task-listing-app"%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # aws_elastic_beanstalk_environment.task_listing_app_environment will be created%0A  + resource "aws_elastic_beanstalk_environment" "task_listing_app_environment" {%0A      + all_settings           = (known after apply)%0A      + application            = "jackdench-task-listing-app"%0A      + arn                    = (known after apply)%0A      + autoscaling_groups     = (known after apply)%0A      + cname                  = (known after apply)%0A      + cname_prefix           = (known after apply)%0A      + endpoint_url           = (known after apply)%0A      + id                     = (known after apply)%0A      + instances              = (known after apply)%0A      + launch_configurations  = (known after apply)%0A      + load_balancers         = (known after apply)%0A      + name                   = "jackdench-task-listing-app-environment"%0A      + platform_arn           = (known after apply)%0A      + queues                 = (known after apply)%0A      + solution_stack_name    = "64bit Amazon Linux 2023 v4.0.1 running Docker"%0A      + tags_all               = (known after apply)%0A      + tier                   = "WebServer"%0A      + triggers               = (known after apply)%0A      + version_label          = (known after apply)%0A      + wait_for_ready_timeout = "20m"%0A%0A      + setting {%0A          + name      = "EC2KeyName"%0A          + namespace = "aws:autoscaling:launchconfiguration"%0A          + value     = "jackdench"%0A        }%0A      + setting {%0A          + name      = "IamInstanceProfile"%0A          + namespace = "aws:autoscaling:launchconfiguration"%0A          + value     = "jackdench-task-listing-app-ec2-instance-profile"%0A        }%0A    }%0A%0A  # aws_iam_instance_profile.task_listing_app_ec2_instance_profile will be created%0A  + resource "aws_iam_instance_profile" "task_listing_app_ec2_instance_profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "jackdench-task-listing-app-ec2-instance-profile"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = "jackdench-task-listing-app-ec2-instance-role"%0A      + tags_all    = (known after apply)%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # aws_iam_role.task_listing_app_ec2_role will be created%0A  + resource "aws_iam_role" "task_listing_app_ec2_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "jackdench-task-listing-app-ec2-instance-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.eb_multi_container_docker will be created%0A  + resource "aws_iam_role_policy_attachment" "eb_multi_container_docker" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.eb_web_tier will be created%0A  + resource "aws_iam_role_policy_attachment" "eb_web_tier" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.eb_worker_tier will be created%0A  + resource "aws_iam_role_policy_attachment" "eb_worker_tier" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ec2_full_access will be created%0A  + resource "aws_iam_role_policy_attachment" "ec2_full_access" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecr_read_only will be created%0A  + resource "aws_iam_role_policy_attachment" "ecr_read_only" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"%0A      + role       = "jackdench-task-listing-app-ec2-instance-role"%0A    }%0A%0A  # aws_s3_bucket.container_bucket will be created%0A  + resource "aws_s3_bucket" "container_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "jackdench-task-listing-app-container-bucket"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "name" = "jackdench-task-listing-app-container-bucket"%0A        }%0A      + tags_all                    = {%0A          + "name" = "jackdench-task-listing-app-container-bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0APlan: 12 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```